# CreateLayerPDMenu

## Description
Creates a Layout Manager layer pull down menu control.

```pascal
PROCEDURE CreateLayerPDMenu(
				nDialogID           : LONGINT;
				nComponentID        : LONGINT;
				widthInStandardChar : INTEGER);
```

```python

def vs.CreateLayerPDMenu(nDialogID, nComponentID, widthInStandardChar):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|nDialogID|LONGINT||
|nComponentID|LONGINT||
|widthInStandardChar|INTEGER|The width of the displayed text in standard character count. See GetDlgCtrlWidthStdCh.|

## Version
Availability: from Vectorworks 2020
## Category
* Dialogs - Modern